[
    {
        "creator": "kevin cunanan chappelle",
        "title": "SPECTER",
        "session": "Summer 2025",
        "link": "https://newart.city/show/specter/",
        "external": true,
        "image": "projects/specter/specter.png",
        "creatorLinks": [
            {
                "label": "Website",
                "url": "https://kvnchpl.com"
            }
        ],
        "description": "SPECTER evokes both the vividness and the chaos of the mind's eye. the restless arrangement of images engulfs you: photographs, ai-generated imagery, and glitchy fragments phase into each other and refuse to fully resolve. nothing unfolds in order. you encounter moments the way you might remember them—out of sequence and perhaps half-fiction, yet charged with feeling. between flashes of dread and sudden tenderness, its fractured narrative is told through the images and their metatext as if through a stream of consciousness. this is a space where feeling lingers longer than fact."
    },
    {
        "creator": "Meg Wilson",
        "title": "Digital Compost Heap",
        "session": "Summer 2025",
        "link": "projects/digital-compost-heap/index.html",
        "external": false,
        "image": "projects/digital-compost-heap/digital-compost-heap.png",
        "creatorLinks": [
            {
                "label": "Tumblr",
                "url": "https://clementinepeel.tumblr.com/"
            },
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/megwils0n"
            }
        ],
        "description": "This interactive work is built from a USB archive of images taken between roughly 2004 and 2010 — early digital photographs that were never meant to be preserved as history. They are fragments of an uncurated life. The system organizes them through the logic of compost. Brown Matter forms the base layer. These are structural, quiet images: spatial, textural, often incidental. They resist attention and break down slowly, creating atmosphere and ground. Green Matter carries emotional charge. Selfies, portraits, and social moments from adolescence surface and dissolve more quickly. They are vivid, nitrogen-rich, and unstable — images where identity was being performed and recorded at the same time.Cultural Spores drift through the field. Interface fragments, pop ephemera, and traces of early social media introduce the atmosphere of a specific era. They ferment the archive from within. Strange Growths appear intermittently: glitches, distortions, and anomalies that interrupt coherence and spread unpredictably. As the cursor moves, digital spores activate and disturb the image field. Fragments emerge, overlap, fade, and degrade. Categories collapse into one another. Digital Compost Heap considers archival decay not as loss, but as transformation. Early digital memory, once stored as if permanent, becomes unstable material. Images soften, bleed, and erode. The archive is rotting."
    },
    {
        "creator": "Kay Zeng",
        "title": "an apple for an .zip",
        "session": "Summer 2025",
        "link": "https://www.kayzeng.com/folder_practice",
        "external": false,
        "image": "projects/folder-practice/folder-practice.png",
        "creatorLinks": [
            {
                "label": "Website",
                "url": "https://kayzeng.com/"
            },
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/kayzeng777"
            }
        ],
        "description": "an apple for an  is a small desktop folder using images of an apple i actually consumed, customized folder settings and folder action scripts, to remind myself of the immigrant agriculture labor behind this and other apples/crops and the difficulties they are facing. You can download the folder at kayzeng.com/folder_practice and send it to someone else as a gift for their . Instructions on how to make a circulatable DMG with all the custom settings preserved are documented on my site."
    },
    {
        "creator": "anahita bahri",
        "title": "sanpaku",
        "session": "Summer 2025",
        "link": "https://anahitabahri.github.io/imperfect-pictures/",
        "external": false,
        "creatorLinks": [
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/anahita.js"
            }
        ]
    },
    {
        "creator": "Jackie Liu",
        "title": "diary2glitter",
        "session": "Summer 2025",
        "link": "https://jackieis.online/diary2glitter/",
        "external": true,
        "image": "projects/diary-2-glitter/diary-2-glitter.gif",
        "creatorLinks": [
            {
                "label": "Website",
                "url": "https://jackieis.online"
            },
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/jackieis.online"
            }
        ],
        "description": "diary2glitter is a work-in-progress collection of excerpts from my daily Notes app diary, turned into glitter text using free, online glitter text creation tools. Since 2022 I've maintained a consistent daily practice of journaling, often being a dumping ground for my ruminations, therapy revelations, feral crashouts, and mundane todo lists. By glitterfy-ing snippets from my diary, I hope to elevate a writing practice that normally isn't so remarkable or publicly-presentable."
    },
    {
        "creator": "Aurora D'Errico",
        "title": "Portrait of a lady on the internet",
        "session": "Summer 2025",
        "link": "https://auroraderrico.com/ladyoninternet/",
        "external": true,
        "image": "projects/lady-on-internet/lady-on-internet.png",
        "creatorLinks": [
            {
                "label": "Website",
                "url": "https://auroraderrico.com/"
            },
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/aurora.derrico/"
            }
        ],
        "description": "A self-portrait assembled from my Twitter bookmarks. Images are cropped into squares and re-arranged into multi-image grids, forming a visual archive of impulses, interests, and recurring aesthetics. Rather than representing the self directly, identity emerges through processes of selection, repetition, and re-formatting. Conceived as a printed publication, the project is now re-circulated online for this final showcase through a scan of the physical work. This work is still in progress."
    },
    {
        "creator": "luci vd",
        "title": "nintendo image archive",
        "session": "Summer 2025",
        "link": "https://luvaldi.hotglue.me/?nintendoarchive",
        "external": true,
        "image": "projects/nintendo-image-archive/nintendo-image-archive.png",
        "creatorLinks": [
            {
                "label": "Instagram (@boyf.oe)",
                "url": "https://www.instagram.com/boyf.oe/"
            },
            {
                "label": "Instagram (@lucivdinonno)",
                "url": "https://www.instagram.com/lucivdinonno/"
            }
        ],
        "description": "my project is an archive of imperfect pictures hidden in my Nintendo DSI/3DS between the years of 2008-2012. it is an unfiltered journey into my day-to-day life, and shows an accurate representation of the things that mattered to me - the things i chose as a 10 year old to document for my future self. these images transport me to a time of creating with no care, with no audience, no expectations. i never imagined that the images i was creating would ever leave the realm of my DS to be shown online. i think it is the result of squeezing out my entire being and filtering it 10x over to its purest form."
    },
    {
        "creator": "Yuemin Huang",
        "title": "Copy & Originality",
        "session": "Summer 2025",
        "link": "https://umin1024.github.io/copyDog",
        "external": false,
        "image": "projects/copy-originality/copy-originality.png",
        "creatorLinks": [
            {
                "label": "Website",
                "url": "https://yueminh.com/"
            }
        ],
        "description": "Play a game. Each block is one pixel. Words = my feeling toward the color of that pixel. This small project was created under the theme Copy Cat. It explores low-resolution imagery, the relationship between text and image, and the tension between imagination and originality. For me, it is an experiment in “writing a novel with images” — where colors become narrative fragments, and words transform pixels into stories. I use AI tools and turned this piece into an interactive game. I invite others to participate and experience this process of generating an “image-novel” together — navigating between coloring and naming, and reconsidering the relationship between image, language, and authorship."
    },
    {
        "creator": "c budnick",
        "title": "face of her loved one",
        "session": "Summer 2025",
        "link": "http://cbudnick.com/exhibition/face-of-her-loved-one",
        "external": false,
        "image": "projects/face-of-her-loved-one/face-of-her-loved-one.png"
    }
]