[
    {
        "creator": "kevin cunanan chappelle",
        "title": "SPECTER",
        "session": "Summer 2025",
        "link": "https://newart.city/show/specter/",
        "external": true,
        "image": "projects/specter/specter.png",
        "creatorLinks": [
            {
                "label": "Website",
                "url": "https://kvnchpl.com"
            }
        ],
        "description": "SPECTER evokes both the vividness and the chaos of the mind's eye. the restless arrangement of images engulfs you: photographs, ai-generated imagery, and glitchy fragments phase into each other and refuse to fully resolve. nothing unfolds in order. you encounter moments the way you might remember them—out of sequence and perhaps half-fiction, yet charged with feeling. between flashes of dread and sudden tenderness, its fractured narrative is told through the images and their metatext as if through a stream of consciousness. this is a space where feeling lingers longer than fact."
    },
    {
        "creator": "Meg Wilson",
        "title": "Digital Compost Heap",
        "session": "Summer 2025",
        "link": "projects/digital-compost-heap/index.html",
        "external": false,
        "image": "projects/digital-compost-heap/digital-compost-heap.png",
        "creatorLinks": [
            {
                "label": "Tumblr",
                "url": "https://clementinepeel.tumblr.com/"
            },
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/megwils0n"
            }
        ],
        "description": "This interactive work is built from a USB archive of images taken between roughly 2004 and 2010 — early digital photographs that were never meant to be preserved as history. They are fragments of an uncurated life. The system organizes them through the logic of compost.\n\nBrown Matter forms the base layer. These are structural, quiet images: spatial, textural, often incidental. They resist attention and break down slowly, creating atmosphere and ground. Green Matter carries emotional charge. Selfies, portraits, and social moments from adolescence surface and dissolve more quickly. They are vivid, nitrogen-rich, and unstable — images where identity was being performed and recorded at the same time. Cultural Spores drift through the field. Interface fragments, pop ephemera, and traces of early social media introduce the atmosphere of a specific era. They ferment the archive from within. Strange Growths appear intermittently: glitches, distortions, and anomalies that interrupt coherence and spread unpredictably.\n\nAs the cursor moves, digital spores activate and disturb the image field. Fragments emerge, overlap, fade, and degrade. Categories collapse into one another. Digital Compost Heap considers archival decay not as loss, but as transformation. Early digital memory, once stored as if permanent, becomes unstable material. Images soften, bleed, and erode. The archive is rotting."
    },
    {
        "creator": "Kay Zeng",
        "title": "an apple for an .zip",
        "session": "Summer 2025",
        "link": "https://www.kayzeng.com/folder_practice",
        "external": false,
        "image": "projects/folder-practice/folder-practice.png",
        "creatorLinks": [
            {
                "label": "Website",
                "url": "https://kayzeng.com/"
            },
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/kayzeng777"
            }
        ],
        "description": "an apple for an  is a small desktop folder using images of an apple i actually consumed, customized folder settings and folder action scripts, to remind myself of the immigrant agriculture labor behind this and other apples/crops and the difficulties they are facing.\n\nyou can download the folder at kayzeng.com/folder_practice and send it to someone else as a gift for their . instructions on how to make a circulatable dmg with all the custom settings preserved are documented on my site."
    },
    {
        "creator": "anahita bahri",
        "title": "sanpaku",
        "session": "Summer 2025",
        "link": "https://anahitabahri.github.io/imperfect-pictures/",
        "external": false,
        "image": "projects/sanpaku/sanpaku.png",
        "creatorLinks": [
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/anahita.js"
            }
        ]
    },
    {
        "creator": "Jackie Liu",
        "title": "diary2glitter",
        "session": "Summer 2025",
        "link": "https://jackieis.online/diary2glitter/",
        "external": false,
        "image": "projects/diary-2-glitter/diary-2-glitter.gif",
        "creatorLinks": [
            {
                "label": "Website",
                "url": "https://jackieis.online"
            },
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/jackieis.online"
            }
        ],
        "description": "diary2glitter is a work-in-progress collection of excerpts from my daily Notes app diary, turned into glitter text using free, online glitter text creation tools. Since 2022 I've maintained a consistent daily practice of journaling, often being a dumping ground for my ruminations, therapy revelations, feral crashouts, and mundane todo lists. By glitterfy-ing snippets from my diary, I hope to elevate a writing practice that normally isn't so remarkable or publicly-presentable."
    },
    {
        "creator": "Aurora D'Errico",
        "title": "Portrait of a lady on the internet",
        "session": "Summer 2025",
        "link": "https://auroraderrico.com/ladyoninternet/",
        "external": true,
        "image": "projects/lady-on-internet/lady-on-internet.png",
        "creatorLinks": [
            {
                "label": "Website",
                "url": "https://auroraderrico.com/"
            },
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/aurora.derrico/"
            }
        ],
        "description": "A self-portrait assembled from my Twitter bookmarks. Images are cropped into squares and re-arranged into multi-image grids, forming a visual archive of impulses, interests, and recurring aesthetics. Rather than representing the self directly, identity emerges through processes of selection, repetition, and re-formatting. Conceived as a printed publication, the project is now re-circulated online for this final showcase through a scan of the physical work. This work is still in progress."
    },
    {
        "creator": "luci vd",
        "title": "nintendo image archive",
        "session": "Summer 2025",
        "link": "https://luvaldi.hotglue.me/?nintendoarchive",
        "external": false,
        "image": "projects/nintendo-image-archive/nintendo-image-archive.png",
        "creatorLinks": [
            {
                "label": "Instagram (@boyf.oe)",
                "url": "https://www.instagram.com/boyf.oe/"
            },
            {
                "label": "Instagram (@lucivdinonno)",
                "url": "https://www.instagram.com/lucivdinonno/"
            }
        ],
        "description": "my project is an archive of imperfect pictures hidden in my Nintendo DSI/3DS between the years of 2008-2012. it is an unfiltered journey into my day-to-day life, and shows an accurate representation of the things that mattered to me - the things i chose as a 10 year old to document for my future self. these images transport me to a time of creating with no care, with no audience, no expectations. i never imagined that the images i was creating would ever leave the realm of my DS to be shown online. i think it is the result of squeezing out my entire being and filtering it 10x over to its purest form."
    },
    {
        "creator": "Yuemin Huang",
        "title": "Copy & Originality",
        "session": "Summer 2025",
        "link": "https://umin1024.github.io/copyDog",
        "external": false,
        "image": "projects/copy-originality/copy-originality.png",
        "creatorLinks": [
            {
                "label": "Website",
                "url": "https://yueminh.com/"
            }
        ],
        "description": "Play a game. Each block is one pixel. Words = my feeling toward the color of that pixel.\n\nThis small project was created under the theme Copy Cat. It explores low-resolution imagery, the relationship between text and image, and the tension between imagination and originality. For me, it is an experiment in “writing a novel with images” — where colors become narrative fragments, and words transform pixels into stories.\n\nI use AI tools and turned this piece into an interactive game. I invite others to participate and experience this process of generating an “image-novel” together — navigating between coloring and naming, and reconsidering the relationship between image, language, and authorship."
    },
    {
        "creator": "c budnick",
        "title": "face of her loved one",
        "session": "Summer 2025",
        "link": "https://cbudnick.com/exhibition/face-of-her-loved-one",
        "external": false,
        "image": "projects/face-of-her-loved-one/face-of-her-loved-one.gif"
    },
    {
        "creator": "jennywhen26",
        "title": "my\"space\" 2.0",
        "session": "Summer 2025",
        "link": "https://jennywhen26.hotglue.me/",
        "external": false,
        "image": "projects/myspace-2/myspace-2.png",
        "description": "welcome to my space online — a (not-quite) one-to-one replica of my apartment, equal parts here and now, and what could be .𖥔 ݁ ˖ִ🛸༄˖°."
    },
    {
        "creator": "salvarez",
        "title": "american faces",
        "session": "Summer 2025",
        "link": "https://salvarezonline.neocities.org/theonlyamericanfaces",
        "external": true,
        "image": "projects/american-faces/american-faces.png",
        "creatorLinks": [
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/salvarezonline/"
            },
            {
                "label": "Website",
                "url": "https://salvarez.online/"
            },
            {
                "label": "Neocities",
                "url": "https://salvarezonline.neocities.org/"
            }
        ],
        "description": "a browser-based experiment staged at mount rushmore. spurred by thoughts about immortalizing yourself in stone, storing yourself in databases, and being woven into the fabric of digital colonialism itself. best viewed on Firefox-based and Chromium-based browsers."
    },
    {
        "creator": "Brittany Orlando",
        "title": "A Town Called Street",
        "session": "Summer 2025",
        "link": "https://brittanyorlando.cargo.site/street",
        "external": true,
        "image": "projects/town-called-street/town-called-street.png",
        "creatorLinks": [
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/winteremains/"
            }
        ],
        "description": "Brittany Orlando is a girl from a town called Street."
    },
    {
        "creator": "RHYSQUAD",
        "title": "manujin's restored folder",
        "session": "Summer 2025",
        "link": "https://rhysquad.hotglue.me/",
        "external": true,
        "image": "projects/manujins-restored-folder/manujins-restored-folder.gif",
        "creatorLinks": [
            {
                "label": "Instagram (manujin)",
                "url": "https://www.instagram.com/manujin/"
            },
            {
                "label": "Instagram (babyp3rson)",
                "url": "https://www.instagram.com/babyp3rson/"
            }
        ],
        "description": "RHYSQUAD is a digital restoration team focused on files, contemporary art, and discovering niche, esoteric, beautiful artists (rare!). We encountered manujin’s folder after he submitted several restoration requests believing he met our criteria. Through the recovery of his deleted archives, we learned they were produced as part of Molly Soda’s course at SFPC. The files are now available for download. Please visit our shop and take our curatorial survey — you might be next!"
    },
    {
        "creator": "Julia Almond Moses",
        "title": "memories of home",
        "session": "Summer 2025",
        "link": "projects/memories-of-home/index.html",
        "external": true,
        "image": "projects/memories-of-home/memories-of-home.png",
        "creatorLinks": [
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/maybe____angel/"
            },
            {
                "label": "Arena",
                "url": "https://www.are.na/julia-moses-sjblkowkqfi"
            }
        ],
        "description": "memories of home is an interactive archive conjured during a period of physical displacement. A travel diary for the lost. Drawing from a digital paper trail (images, recordings, screenshots, and links) the project maps fragments of memory to geographic coordinates. The map attempts to uncover orientation but reveals how images and media meant to anchor a sense of home fail to fully resolve."
    },
    {
        "creator": "Maria Agra",
        "title": "Digital Landscapes",
        "session": "Summer 2025",
        "link": "https://maria-agra.art/portfolio/landscape-zine/",
        "external": true,
        "image": "projects/digital-landscapes/digital-landscapes.png",
        "creatorLinks": [
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/agra_maria_art/"
            }
        ],
        "description": "This project takes the form of a booklet that opens in a 16:9 format, echoing the proportions of the screen. It focuses on landscapes we often encounter not in person, but as desktop wallpapers: vast, awe-inspiring scenes rendered into digital backdrops. Starting as digital files, these landscapes are processed and distorted, then brought back into the physical world and reworked by hand with coloured pencils and embroidery.\n\nThe work reflects on the shifting status of these images of nature as they oscillate between digital and physical forms, questioning how the screen both frames and distances our experience of the sublime."
    },
    {
        "creator": "Anoushka Carroll",
        "title": "a digital garden",
        "session": "Summer 2025",
        "link": "https://anoushka.neocities.org/digitalgarden/",
        "external": true,
        "image": "projects/digital-garden/digital-garden.png",
        "creatorLinks": [
            {
                "label": "Instagram",
                "url": "https://instagram.com/4n0u5hk4/"
            },
            {
                "label": "Website",
                "url": "https://anoushka.rocks"
            }
        ],
        "description": "I’ve been overwhelmed by the amount of files I’ve been making during this course. As a kid/teen of course I would be saving my favourite fan arts, dollz, pics, etc, but as an adult everything goes on Google Drive. I feel like I can’t organise/keep track of everything. Visual overload.\n\nI’ve combined that idea with an ongoing annoyance with the concept of “digital gardens”. Such a term sounds playful and intriguing, but after some research/googling, a digital garden is nothing more than a blog rebranded! Boo!\n\nTo make an actual digital garden has fueled my interest in getting back into web coding and creating interactive websites that work like games but are still just websites. This can be done with P5 and interactive stuff like that but I’m interested in the outcomes having more of an “old web” or “y2k web” or “web 1” look/feel.\n\nSo I’ve vibe coded a webpage where each time you click refresh a new composition shows up - made from my personal files/screen shots and garden gifs and jpegs. The viewer is you sitting in your chair at your computer gazing through your window (maybe in a kitchen or parlour) to regard my landscaping.\n\nI want to invoke that chaos of the amount of information we get through web 2 now - endless streams of content. There’s up to 300 files I think. More can be added - the limit is my neocities’ subscription allowance."
    },
    {
        "creator": "Silas Munro",
        "title": "Triple-Double Consciousness",
        "session": "Summer 2025",
        "link": "projects/triple-double-consciousness/index.html",
        "external": false,
        "image": "projects/triple-double-consciousness/triple-double-consciousness_thumbnail.png",
        "creatorLinks": [
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/siborg81/"
            },
            {
                "label": "Website",
                "url": "https://www.polymode.studio/"
            }
        ],
        "description": "In these Jacquard-woven textiles, I created a self-portrait with uncanny resonances and resemblances between myself and Du Bois. On one side of the diptych, I superimposed my own face into a well-known photograph of Du Bois at the 1900 Paris Exposition, where he first exhibited his signature data portraits. The title of the work—like that of the exhibition it is in—references Du Bois’s concept of double consciousness, the racialized sensation and unreconciled striving of looking at and measuring oneself through the eyes of others. Triple consciousness extends this concept even further, underscoring how race inevitably intersects with gender and sexuality. I’ve always been fascinated this particular portrait of Du Bois and how it presents Du Bois as a Black Dandy. I have written about his data visualizations, and feel close to him. In reproducing his image, I thought about his term double consciousness where Black people have this two ways of seeing them selves, and how for me as queer Black man, there is another layer of consciousness on top of that a kind of “triple consciousness.” To me Du Bois is queered by my presence, and the history of Dandies, In doubling this image and flipping it—thinking of Hito Steyerl’s “poor image” translated into textiles where there is both a shadow and a lowering of resolution, but a deepening of meaning when we are shown in mirror of each other. The Triple Double is a term in Basketball when a player in basketball a double digit total in three of the five main statistical categories. This double entendre about data point for the hyper masculine sport that I don’t play also is playing up this contrast between us. Historical accounts of Du Bois point of view of queerness are mixed. There is record of him being critical of a queer contemporary Alain Locke, but also rumors and hearsay about his own closet queerness."
    },
    {
        "creator": "Silas Munro",
        "title": "Auto Bio Grid-ography Hafrican Black Data Betta’ Do Me Right (Beta)",
        "session": "Summer 2025",
        "link": "projects/auto-bio-grid-ography/index.html",
        "external": false,
        "image": "projects/auto-bio-grid-ography/auto-bio-grid-ography_thumbnail.png",
        "creatorLinks": [
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/siborg81/"
            },
            {
                "label": "Website",
                "url": "https://www.polymode.studio/"
            }
        ],
        "description": "In this site-specific work, I assemble African design patterns, family photographs, and grids printed directly onto the wall by the mechanical arm of a vertical UV inkjet printer. These elements serve as a set of data points for me to map textures and colors related to my lineage. A Scottish tartan pattern overlays an image of sacks of beans in a street market in Kampala, Uganda, nodding to my parental heritage. In another moment, a complex fractal called the Mandelbrot set overlaps a wedding photo of my parents, visualizing transitions from order to chaos. The work has grown out of my ongoing Black Grids project, which uses fractal geometry to complicate the grid and its formidable presence in art history, mathematics, design, philosophy, and other disciplines.\n\nThis work features a mix of images from my mother and father’s photo archives from the 1950s–1990s including some of my Mother’s trips home to Uganda. Woven through those archives are photos I took from my first trip to Uganda as adult, self portraits as an a young man playing with masking, concealment, and experiments with my 1/2 Ugandan friend Paul Sepuya who’s collaborative practice allowed us to bridge our common experience as queer Black artists. These images are framed by patterns based on my research into the Hima tribe in referenced in the research of Louise E. Jefferson, that were generating using the open-sources software processing."
    },
    {
        "creator": "Geanna Gwinn",
        "title": "Build-a-familytree",
        "session": "Summer 2025",
        "link": "https://ggwinn.github.io/build-a-family-tree/",
        "external": false,
        "image": "projects/build-a-family-tree/build-a-family-tree.png",
        "creatorLinks": [
            {
                "label": "Instagram",
                "url": "https://www.instagram.com/geqnna"
            }
        ],
        "description": "Build-a-familytree is a project that encourages building a location of comfort visually and healing-wise through recognizing the small and large acts between one's friends, community, chosen family, old lovers, old friends, and how media allows one to build a portrait of comfort. It is a digital form of shadow work. It explores and embraces the spectrum of healing."
    }
]